# Лаб. 5

| №варианта | №1 | №2 | №3 | №4 | №5 | №6 | №7  |
|:---------:|:--:|:--:|:--:|:--:|:--:|:--:|:---:|
| 1         | 1  | 1  |   1|   1|   1|   1| 1, 2|

## 1 Шаблоны

В класс Дробь, добавить интерфейс на два метода: получение вещественного значения, установка числителя и установка знаменателя.
Сгенерировать такую версию дроби, которая будет кэшировать вычисление вещественного значения.
Если раннее в вашем варианте не было Дроби, то создайте сущность Дробь со следующими особенностями:

* Имеет числитель: целое число
* Имеет знаменатель: целое число
* Дробь может быть создана с указанием числителя и знаменателя
* Может вернуть строковое представление вида “числитель/знаменатель”
* Необходимо корректно обрабатывать отрицательные значения. Учтите, что знаменатель не может быть отрицательным.
* Переопределите метод сравнения объектов по состоянию таким образом, чтобы две дроби считались одинаковыми тогда, когда у них одинаковые значения числителя и знаменателя

## 2 Структурные шаблоны. Количество мяуканий.

Необходимо воспользоваться классом Кот и методом принимающим всех мяукающих из задачи 2.5.4.
Необходимо таким образом передать кота в указанный метод, что бы после окончания его работы узнать сколько раз мяукал кот за время его работы. На рисунке показан пример работы. Перед вызовом метода создаем кота, отправляем ссылку на кота в метод, после окончания его работы выводим количество мяуканий на экран. Кота изменять нельзя.

``` java
Meowable m = ...; // создаем кота
Funs.meowCare(m);
System.out.print(...); // Вывод: кот мяукал 5 раз
```

Если раннее в вашем варианте не было Кота, то создайте

1. сущность Кот, которая описывается следующим образом:
    * Имеет Имя (строка)
    * Для создания необходимо указать имя кота.
    * Может быть приведен к текстовой форме вида: “кот: Имя”
    * Может помяукать, что приводит к выводу на экран следующего текста: “Имя: мяу!”, вызвать мяуканье можно без параметров.

2. интерфейс Мяуканье: разработайте метод, который принимает набор объектов способных мяукать и вызывает мяуканье у каждого объекта. Мяукающие объекты должны иметь метод со следующей сигнатурой:
`public void meow();`

## 3 Список

 Составить программу, которая удаляет из списка L все элементы E, если такие есть.

## 4 Мап

На вход программы подаются фамилии и имена учеников. Известно, что общее количество
учеников не превосходит 100. В первой строке вводится количество учеников, принимавших
участие в соревнованиях, N. Далее следуют N строк, имеющих следующий формат:\
__<Фамилия><Имя>__

Здесь 
* __<Фамилия>__ – строка, состоящая не более чем из 20 символов; 
* __<Имя>__ – строка, состоящая не более чем из 15 символов. 

При этом <Фамилия> и <Имя> разделены одним пробелом. Примеры входных строк:\
Иванова Мария\
Петров Сергей

Требуется написать программу, которая формирует и печатает уникальный логин для каждого
ученика по следующему правилу: 
* если фамилия встречается первый раз, то логин – это данная
фамилия, 
* если фамилия встречается второй раз, то логин – это фамилия, в конец которой
приписывается число 2 и т.д. 

Например, для входной последовательности:\
Иванова Мария\
Петров Сергей\
Бойцова Екатерина\
Петров Иван\
Иванова Наташа

будут сформированы следующие логины:\
Иванова\
Петров\
Бойцова\
Петров2\
Иванова2

## 5 Сет

Файл содержит текст на русском языке. Напечатать в алфавитном порядке все звонкие согласные буквы, которые входят хотя бы в одно слово.

## 6 Очередь

Напечатать в обратном порядке элементы непустой очереди L.

## 7 Стрим

### 7.1

Необходимо написать стрим:
Дан набор объектов типа Point, необходимо взять все Point в разных координатах, убрать с
одинаковыми X,Y, отсортировать по X, отрицательные Y сделать положительными и собрать это
все в ломаную (объект типа Polyline)
Если раннее в вашем варианте не было задание с классом Point и Polyline, то написать их:
1. класс Point:
    * Координата Х: число.
    * Координата Y: число.
    * Может возвращать текстовое представление вида “{X;Y}”.
2. класс Line (Линия), расположенная на двумерной плоскости, которая описывается:
    * Координата начала: Точка
    * Координата конца: Точка
    * Может возвращать текстовое представление вида “Линия от {X1;Y1} до {X2;Y2}”
3. класс Polyline (Ломаная), которая будет представлять собой ломаную линию. Ломаная
линия представляет собой набор следующих характеристик:
    * Имеет массив Точек, через которые линия проходит.
    * Может быть приведена к строковой форме вида “Линия [Т1,T2,…,TN]”, где TN – это
результат приведения к строке Точки с номером N

### 7.2

Дан текстовый файл со строками, содержащими имя человека и его номер в следующей форме:\
Вася:5\
Петя:3\
Аня:5

Номера людей могут повторяться. У каких-то людей может не быть номера.
Необходимо написать стрим выполняющую следующее:
читаются все люди из файла, все имена приводится к нижнему регистру, 
но с первой буквой в верхнем регистре, убираем из перечня всех людей без номеров, 
а имена оставшихся группируются по их номеру:\
[5:[Вася, Аня], 3:[Петя]]